In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)
# from pandas import ExcelFile

In [2]:
data_house = pd.read_csv("E:/DA/data-sources/Bengaluru_House_Data.csv")    
data_house.head(10)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00
8,Super built-up Area,Ready To Move,Marathahalli,3 BHK,NaN,1310,3.0,1.0,63.25
9,Plot Area,Ready To Move,Gandhi Bazar,6 Bedroom,NaN,1020,6.0,NaN,370.00

In [3]:
data_house.shape

(13320, 9)

In [4]:
data_house.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [5]:
data_house['area_type'].unique()

array(['Super built-up  Area', 'Plot  Area', 'Built-up  Area',
       'Carpet  Area'], dtype=object)

In [6]:
data_house['area_type'].value_counts()

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64

### Drop những features cho rằng không dùng đến

In [7]:
data2 = data_house.drop(['area_type','society','balcony','availability'],axis='columns')
data2.shape

(13320, 5)

### Data Cleaning : Xử lý các giá trị NA

In [8]:
data2.isnull()

       location   size  total_sqft   bath  price
0         False  False       False  False  False
1         False  False       False  False  False
2         False  False       False  False  False
3         False  False       False  False  False
4         False  False       False  False  False
...         ...    ...         ...    ...    ...
13315     False  False       False  False  False
13316     False  False       False  False  False
13317     False  False       False  False  False
13318     False  False       False  False  False
13319     False  False       False  False  False

[13320 rows x 5 columns]

In [9]:
nan_in_col  = data2[data2['location'].isnull()]
nan_in_col.head()

    location   size total_sqft  bath  price
568      NaN  3 BHK       1600   3.0   86.0

In [10]:
data2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [11]:
data2.shape

(13320, 5)

In [12]:
data3 = data2.dropna()
data3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [13]:
data3.shape

(13246, 5)

In [14]:
my_list = [1, 5, 4, 6, 8, 11, 3, 12]

new_list = filter(lambda x: (x%2 == 0) , my_list)

print(new_list)

<filter object at 0x00000206694636A0>

## Feature Engineering
#### Add new feature(int) for bhk :

In [15]:
data3.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [16]:
data3['bhk']=data3['size'].apply(lambda x : int(x.split(' ')[0]))

C:\Users\84936\AppData\Local\Temp\ipykernel_9844\3500204631.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data3['bhk']=data3['size'].apply(lambda x : int(x.split(' ')[0]))

#### Explore total_sqft feature :

In [17]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [18]:
# Tìm các row data có total_sqft không thể ép kiểu float
data3[~data3['total_sqft'].apply(is_float)].head(10)

               location       size      total_sqft  bath    price  bhk
30            Yelahanka      4 BHK     2100 - 2850   4.0  186.000    4
122              Hebbal      4 BHK     3067 - 8156   4.0  477.000    4
137  8th Phase JP Nagar      2 BHK     1042 - 1105   2.0   54.005    2
165            Sarjapur      2 BHK     1145 - 1340   2.0   43.490    2
188            KR Puram      2 BHK     1015 - 1540   2.0   56.800    2
410             Kengeri      1 BHK  34.46Sq. Meter   1.0   18.500    1
549         Hennur Road      2 BHK     1195 - 1440   2.0   63.770    2
648             Arekere  9 Bedroom       4125Perch   9.0  265.000    9
661           Yelahanka      2 BHK     1120 - 1145   2.0   48.130    2
672        Bettahalsoor  4 Bedroom     3090 - 5002   4.0  445.000    4

In [75]:
def to_squareRoot(x) : 
    arr = x.split('Sq. ')
    if(arr[1] == "Yards"):
        return float(arr[0])*9
    elif (arr[1] == "Meter"):
        return float(arr[0]) * 10.76
to_squareRoot("142.84Sq. Meter")

1536.9584

In [76]:
# Đối với các data total_sqft đó ta sử dụng hàm chuyển đổi do ta tự tạo
import re
def convert_sqft_to_num(x):
    arr = x.split('-')
    if(len(arr)==2):
        return (float(arr[0]) + float(arr[1]))/2
    try :
        return float(re.sub("[a-zA-Z]", "", x))
    except:
        return to_squareRoot(x)

In [45]:
print(type(data3))

<class 'pandas.core.frame.DataFrame'>

In [79]:
data4 = data3.copy()
# Convert total_sqft thành dạng float, đối với các data phức tạp hơn nhủ "34.46Sq. Meter" ta sẽ xử lý sau
data4.total_sqft = data4.total_sqft.apply(convert_sqft_to_num)

In [80]:
# data3[30:31:1]
data4[406:411:1]

               location       size  total_sqft  bath  price  bhk
410             Kengeri      1 BHK    370.7896   1.0   18.5    1
411     Sanne Amanikere      2 BHK   1185.0000   2.0   38.0    2
412             Kengeri      2 BHK    750.0000   2.0   38.0    2
413  Mahalakshmi Layout  6 Bedroom   1200.0000   7.0  250.0    6
414      Kanakpura Road      3 BHK   1550.0000   3.0   64.5    3

In [81]:
# Các data có trường total_sqft là Null
data4[data4.total_sqft.isnull()]
# Kiểm tra các data của trường total_sqft chưa được đổi thành dạng float, ta còn các data như sau : 
data4[~data4.total_sqft.apply(is_float)]

Empty DataFrame
Columns: [location, size, total_sqft, bath, price, bhk]
Index: []

In [77]:
data4[406:411:1]

               location       size      total_sqft  bath  price  bhk
410             Kengeri      1 BHK  34.46Sq. Meter   1.0   18.5    1
411     Sanne Amanikere      2 BHK          1185.0   2.0   38.0    2
412             Kengeri      2 BHK           750.0   2.0   38.0    2
413  Mahalakshmi Layout  6 Bedroom          1200.0   7.0  250.0    6
414      Kanakpura Road      3 BHK          1550.0   3.0   64.5    3

In [74]:
# spread in Python
numbers = [1, 2, 3, 4]
atest= pd.array(numbers)
new_numbers = [0, *atest, 4]
print(new_numbers)

[0, 1, 2, 3, 4, 4]